dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxPsi5_bf.h
/** \brief Offset for Ifx_PSI5_ACCEN0_Bits.EN29 */
#define IFX_PSI5_ACCEN0_EN29_OFF (29u)

/** \brief Length for Ifx_PSI5_ACCEN0_Bits.EN30 */
#define IFX_PSI5_ACCEN0_EN30_LEN (1u)

/** \brief Mask for Ifx_PSI5_ACCEN0_Bits.EN30 */
#define IFX_PSI5_ACCEN0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_ACCEN0_Bits.EN30 */
#define IFX_PSI5_ACCEN0_EN30_OFF (30u)

/** \brief Length for Ifx_PSI5_ACCEN0_Bits.EN31 */
#define IFX_PSI5_ACCEN0_EN31_LEN (1u)

/** \brief Mask for Ifx_PSI5_ACCEN0_Bits.EN31 */
#define IFX_PSI5_ACCEN0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_ACCEN0_Bits.EN31 */
#define IFX_PSI5_ACCEN0_EN31_OFF (31u)

/** \brief Length for Ifx_PSI5_KRST0_Bits.RST */
#define IFX_PSI5_KRST0_RST_LEN (1u)

/** \brief Mask for Ifx_PSI5_KRST0_Bits.RST */
#define IFX_PSI5_KRST0_RST_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_KRST0_Bits.RST */
#define IFX_PSI5_KRST0_RST_OFF (0u)

/** \brief Length for Ifx_PSI5_KRST0_Bits.RSTSTAT */
#define IFX_PSI5_KRST0_RSTSTAT_LEN (1u)

/** \brief Mask for Ifx_PSI5_KRST0_Bits.RSTSTAT */
#define IFX_PSI5_KRST0_RSTSTAT_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_KRST0_Bits.RSTSTAT */
#define IFX_PSI5_KRST0_RSTSTAT_OFF (1u)

/** \brief Length for Ifx_PSI5_KRST1_Bits.RST */
#define IFX_PSI5_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_PSI5_KRST1_Bits.RST */
#define IFX_PSI5_KRST1_RST_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_KRST1_Bits.RST */
#define IFX_PSI5_KRST1_RST_OFF (0u)

/** \brief Length for Ifx_PSI5_KRSTCLR_Bits.CLR */
#define IFX_PSI5_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_PSI5_KRSTCLR_Bits.CLR */
#define IFX_PSI5_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_KRSTCLR_Bits.CLR */
#define IFX_PSI5_KRSTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_PSI5_RFC_Bits.REP */
#define IFX_PSI5_RFC_REP_LEN (6u)

/** \brief Mask for Ifx_PSI5_RFC_Bits.REP */
#define IFX_PSI5_RFC_REP_MSK (0x3fu)

/** \brief Offset for Ifx_PSI5_RFC_Bits.REP */
#define IFX_PSI5_RFC_REP_OFF (0u)

/** \brief Length for Ifx_PSI5_RFC_Bits.WRP */
#define IFX_PSI5_RFC_WRP_LEN (6u)

/** \brief Mask for Ifx_PSI5_RFC_Bits.WRP */
#define IFX_PSI5_RFC_WRP_MSK (0x3fu)

/** \brief Offset for Ifx_PSI5_RFC_Bits.WRP */
#define IFX_PSI5_RFC_WRP_OFF (8u)

/** \brief Length for Ifx_PSI5_RFC_Bits.FWL */
#define IFX_PSI5_RFC_FWL_LEN (5u)

/** \brief Mask for Ifx_PSI5_RFC_Bits.FWL */
#define IFX_PSI5_RFC_FWL_MSK (0x1fu)

/** \brief Offset for Ifx_PSI5_RFC_Bits.FWL */
#define IFX_PSI5_RFC_FWL_OFF (16u)

/** \brief Length for Ifx_PSI5_RFC_Bits.WRAP */
#define IFX_PSI5_RFC_WRAP_LEN (1u)

/** \brief Mask for Ifx_PSI5_RFC_Bits.WRAP */
#define IFX_PSI5_RFC_WRAP_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RFC_Bits.WRAP */
#define IFX_PSI5_RFC_WRAP_OFF (29u)

/** \brief Length for Ifx_PSI5_RFC_Bits.FRQ */
#define IFX_PSI5_RFC_FRQ_LEN (1u)

/** \brief Mask for Ifx_PSI5_RFC_Bits.FRQ */
#define IFX_PSI5_RFC_FRQ_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RFC_Bits.FRQ */
#define IFX_PSI5_RFC_FRQ_OFF (30u)

/** \brief Length for Ifx_PSI5_RFC_Bits.FLU */
#define IFX_PSI5_RFC_FLU_LEN (1u)

/** \brief Mask for Ifx_PSI5_RFC_Bits.FLU */
#define IFX_PSI5_RFC_FLU_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RFC_Bits.FLU */
#define IFX_PSI5_RFC_FLU_OFF (31u)

/** \brief Length for Ifx_PSI5_RDF_Bits.RD */
#define IFX_PSI5_RDF_RD_LEN (32u)

/** \brief Mask for Ifx_PSI5_RDF_Bits.RD */
#define IFX_PSI5_RDF_RD_MSK (0xffffffffu)

/** \brief Offset for Ifx_PSI5_RDF_Bits.RD */
#define IFX_PSI5_RDF_RD_OFF (0u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI0 */
#define IFX_PSI5_RSIOV_RSI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI0 */
#define IFX_PSI5_RSIOV_RSI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI0 */
#define IFX_PSI5_RSIOV_RSI0_OFF (0u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI1 */
#define IFX_PSI5_RSIOV_RSI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI1 */
#define IFX_PSI5_RSIOV_RSI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI1 */
#define IFX_PSI5_RSIOV_RSI1_OFF (1u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI2 */
#define IFX_PSI5_RSIOV_RSI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI2 */
#define IFX_PSI5_RSIOV_RSI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI2 */
#define IFX_PSI5_RSIOV_RSI2_OFF (2u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI3 */
#define IFX_PSI5_RSIOV_RSI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI3 */
#define IFX_PSI5_RSIOV_RSI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI3 */
#define IFX_PSI5_RSIOV_RSI3_OFF (3u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI4 */
#define IFX_PSI5_RSIOV_RSI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI4 */
#define IFX_PSI5_RSIOV_RSI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI4 */
#define IFX_PSI5_RSIOV_RSI4_OFF (4u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI5 */
#define IFX_PSI5_RSIOV_RSI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI5 */
#define IFX_PSI5_RSIOV_RSI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI5 */
#define IFX_PSI5_RSIOV_RSI5_OFF (5u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI6 */
#define IFX_PSI5_RSIOV_RSI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI6 */
#define IFX_PSI5_RSIOV_RSI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI6 */
#define IFX_PSI5_RSIOV_RSI6_OFF (6u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI7 */
#define IFX_PSI5_RSIOV_RSI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI7 */
#define IFX_PSI5_RSIOV_RSI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI7 */
#define IFX_PSI5_RSIOV_RSI7_OFF (7u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI8 */
#define IFX_PSI5_RSIOV_RSI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI8 */
#define IFX_PSI5_RSIOV_RSI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI8 */
#define IFX_PSI5_RSIOV_RSI8_OFF (8u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI9 */
#define IFX_PSI5_RSIOV_RSI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI9 */
#define IFX_PSI5_RSIOV_RSI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI9 */
#define IFX_PSI5_RSIOV_RSI9_OFF (9u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI10 */
#define IFX_PSI5_RSIOV_RSI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI10 */
#define IFX_PSI5_RSIOV_RSI10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI10 */
#define IFX_PSI5_RSIOV_RSI10_OFF (10u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI11 */
#define IFX_PSI5_RSIOV_RSI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI11 */
#define IFX_PSI5_RSIOV_RSI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI11 */
#define IFX_PSI5_RSIOV_RSI11_OFF (11u)

/** \brief Length for Ifx_PSI5_RSIOV_Bits.RSI12 */
#define IFX_PSI5_RSIOV_RSI12_LEN (1u)

/** \brief Mask for Ifx_PSI5_RSIOV_Bits.RSI12 */
#define IFX_PSI5_RSIOV_RSI12_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_RSIOV_Bits.RSI12 */
#define IFX_PSI5_RSIOV_RSI12_OFF (12u)

