dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxPsi5_bf.h
/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI20 */
#define IFX_PSI5_NBIOV_NBI20_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI20 */
#define IFX_PSI5_NBIOV_NBI20_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI20 */
#define IFX_PSI5_NBIOV_NBI20_OFF (20u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI21 */
#define IFX_PSI5_NBIOV_NBI21_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI21 */
#define IFX_PSI5_NBIOV_NBI21_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI21 */
#define IFX_PSI5_NBIOV_NBI21_OFF (21u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI22 */
#define IFX_PSI5_NBIOV_NBI22_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI22 */
#define IFX_PSI5_NBIOV_NBI22_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI22 */
#define IFX_PSI5_NBIOV_NBI22_OFF (22u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI23 */
#define IFX_PSI5_NBIOV_NBI23_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI23 */
#define IFX_PSI5_NBIOV_NBI23_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI23 */
#define IFX_PSI5_NBIOV_NBI23_OFF (23u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI24 */
#define IFX_PSI5_NBIOV_NBI24_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI24 */
#define IFX_PSI5_NBIOV_NBI24_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI24 */
#define IFX_PSI5_NBIOV_NBI24_OFF (24u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI25 */
#define IFX_PSI5_NBIOV_NBI25_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI25 */
#define IFX_PSI5_NBIOV_NBI25_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI25 */
#define IFX_PSI5_NBIOV_NBI25_OFF (25u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI26 */
#define IFX_PSI5_NBIOV_NBI26_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI26 */
#define IFX_PSI5_NBIOV_NBI26_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI26 */
#define IFX_PSI5_NBIOV_NBI26_OFF (26u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI27 */
#define IFX_PSI5_NBIOV_NBI27_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI27 */
#define IFX_PSI5_NBIOV_NBI27_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI27 */
#define IFX_PSI5_NBIOV_NBI27_OFF (27u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI28 */
#define IFX_PSI5_NBIOV_NBI28_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI28 */
#define IFX_PSI5_NBIOV_NBI28_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI28 */
#define IFX_PSI5_NBIOV_NBI28_OFF (28u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI29 */
#define IFX_PSI5_NBIOV_NBI29_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI29 */
#define IFX_PSI5_NBIOV_NBI29_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI29 */
#define IFX_PSI5_NBIOV_NBI29_OFF (29u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI30 */
#define IFX_PSI5_NBIOV_NBI30_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI30 */
#define IFX_PSI5_NBIOV_NBI30_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI30 */
#define IFX_PSI5_NBIOV_NBI30_OFF (30u)

/** \brief Length for Ifx_PSI5_NBIOV_Bits.NBI31 */
#define IFX_PSI5_NBIOV_NBI31_LEN (1u)

/** \brief Mask for Ifx_PSI5_NBIOV_Bits.NBI31 */
#define IFX_PSI5_NBIOV_NBI31_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_NBIOV_Bits.NBI31 */
#define IFX_PSI5_NBIOV_NBI31_OFF (31u)

/** \brief Length for Ifx_PSI5_TEIOV_Bits.TEI0 */
#define IFX_PSI5_TEIOV_TEI0_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEIOV_Bits.TEI0 */
#define IFX_PSI5_TEIOV_TEI0_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEIOV_Bits.TEI0 */
#define IFX_PSI5_TEIOV_TEI0_OFF (0u)

/** \brief Length for Ifx_PSI5_TEIOV_Bits.TEI1 */
#define IFX_PSI5_TEIOV_TEI1_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEIOV_Bits.TEI1 */
#define IFX_PSI5_TEIOV_TEI1_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEIOV_Bits.TEI1 */
#define IFX_PSI5_TEIOV_TEI1_OFF (1u)

/** \brief Length for Ifx_PSI5_TEIOV_Bits.TEI2 */
#define IFX_PSI5_TEIOV_TEI2_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEIOV_Bits.TEI2 */
#define IFX_PSI5_TEIOV_TEI2_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEIOV_Bits.TEI2 */
#define IFX_PSI5_TEIOV_TEI2_OFF (2u)

/** \brief Length for Ifx_PSI5_TEIOV_Bits.TEI3 */
#define IFX_PSI5_TEIOV_TEI3_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEIOV_Bits.TEI3 */
#define IFX_PSI5_TEIOV_TEI3_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEIOV_Bits.TEI3 */
#define IFX_PSI5_TEIOV_TEI3_OFF (3u)

/** \brief Length for Ifx_PSI5_TEIOV_Bits.TEI4 */
#define IFX_PSI5_TEIOV_TEI4_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEIOV_Bits.TEI4 */
#define IFX_PSI5_TEIOV_TEI4_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEIOV_Bits.TEI4 */
#define IFX_PSI5_TEIOV_TEI4_OFF (4u)

/** \brief Length for Ifx_PSI5_TEIOV_Bits.TEI5 */
#define IFX_PSI5_TEIOV_TEI5_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEIOV_Bits.TEI5 */
#define IFX_PSI5_TEIOV_TEI5_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEIOV_Bits.TEI5 */
#define IFX_PSI5_TEIOV_TEI5_OFF (5u)

/** \brief Length for Ifx_PSI5_TEIOV_Bits.TEI6 */
#define IFX_PSI5_TEIOV_TEI6_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEIOV_Bits.TEI6 */
#define IFX_PSI5_TEIOV_TEI6_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEIOV_Bits.TEI6 */
#define IFX_PSI5_TEIOV_TEI6_OFF (6u)

/** \brief Length for Ifx_PSI5_TEIOV_Bits.TEI7 */
#define IFX_PSI5_TEIOV_TEI7_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEIOV_Bits.TEI7 */
#define IFX_PSI5_TEIOV_TEI7_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEIOV_Bits.TEI7 */
#define IFX_PSI5_TEIOV_TEI7_OFF (7u)

/** \brief Length for Ifx_PSI5_TEIOV_Bits.TEI8 */
#define IFX_PSI5_TEIOV_TEI8_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEIOV_Bits.TEI8 */
#define IFX_PSI5_TEIOV_TEI8_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEIOV_Bits.TEI8 */
#define IFX_PSI5_TEIOV_TEI8_OFF (8u)

/** \brief Length for Ifx_PSI5_TEIOV_Bits.TEI9 */
#define IFX_PSI5_TEIOV_TEI9_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEIOV_Bits.TEI9 */
#define IFX_PSI5_TEIOV_TEI9_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEIOV_Bits.TEI9 */
#define IFX_PSI5_TEIOV_TEI9_OFF (9u)

/** \brief Length for Ifx_PSI5_TEIOV_Bits.TEI10 */
#define IFX_PSI5_TEIOV_TEI10_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEIOV_Bits.TEI10 */
#define IFX_PSI5_TEIOV_TEI10_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEIOV_Bits.TEI10 */
#define IFX_PSI5_TEIOV_TEI10_OFF (10u)

/** \brief Length for Ifx_PSI5_TEIOV_Bits.TEI11 */
#define IFX_PSI5_TEIOV_TEI11_LEN (1u)

/** \brief Mask for Ifx_PSI5_TEIOV_Bits.TEI11 */
#define IFX_PSI5_TEIOV_TEI11_MSK (0x1u)

/** \brief Offset for Ifx_PSI5_TEIOV_Bits.TEI11 */
#define IFX_PSI5_TEIOV_TEI11_OFF (11u)

